{
  "backend/main.mo": "Main backend actor defining Quest and UserProfile data types, quest management functions (create, accept, crowdfund, check-in, complete), user profile operations, and access control integration with authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: splash screen 'How it works?' link, introduction modal component, and comprehensive translation keys for Grit Bounty concept across three languages.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend components including App flow management, Layout, language selection, splash screen, main app with 3-tab navigation, bounty board, quest cards, launch mission form, personal center, hooks, translations, and styling.",
  "frontend/index.css": "Global Tailwind CSS styles with dark theme design system using OKLCH color space, defining CSS custom properties for colors, borders, and component theming in both light and dark modes.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, 'Grit Bounty' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component managing three-step flow (splash/authenticating/authenticated) with Internet Identity login, actor initialization, 10-second timeout fallback, and conditional rendering of SplashScreen, loading state, or MainApp.",
  "frontend/src/components/AbandonQuestDialog.tsx": "Confirmation dialog for abandoning accepted quests, displaying forfeit amount and deposit rate reset warning, requiring user to type 'CONFIRM' before executing abandonQuest mutation with loading state.",
  "frontend/src/components/AddToPotDialog.tsx": "Dialog component for adding ICP contributions to a quest's reward pool, with input validation, current/new pool display, and integration with the useAddToPot mutation hook.",
  "frontend/src/components/AppealSubmission.tsx": "Component for submitting appeals in a three-tier dispute system, allowing publishers and warriors to provide reasoning (minimum 100 characters) with tier-based badge display and submission status tracking.",
  "frontend/src/components/BountyBoard.tsx": "Main quest listing component with tabbed difficulty filtering (all/easy/medium/hard), displaying active quests in a responsive grid using QuestCard components.",
  "frontend/src/components/CreditScoreDisplay.tsx": "Displays user credit score metrics including deposit rate (50% to 2%), successful quests, progress bar, total earned/deposited ICP, and warnings for high deposit rates.",
  "frontend/src/components/DailyCheckIn.tsx": "Dialog for submitting daily check-ins with status text and optional photo upload (max 5MB), showing progress toward quest completion target with upload progress tracking.",
  "frontend/src/components/DeleteQuestDialog.tsx": "Confirmation alert dialog for deleting quests, displaying quest details and warnings with loading state during the deletion mutation.",
  "frontend/src/components/DepositConfirmationDialog.tsx": "A dialog component that displays quest details (reward pool, participants, deposit rate) and allows users to confirm their deposit with loading and error states.",
  "frontend/src/components/DisputeVoting.tsx": "A component for displaying and voting on quest disputes, showing publisher and warrior arguments with weighted voting progress (currently shows placeholder UI when no disputes exist).",
  "frontend/src/components/ErrorBoundary.tsx": "A React error boundary class component that catches and displays application errors with a reload button and expandable error details.",
  "frontend/src/components/ExitQuestDialog.tsx": "An alert dialog that allows quest publishers to exit a quest, showing contribution details and handling refunds for both publisher and crowdfunding contributors.",
  "frontend/src/components/IntroductionModal.tsx": "A scrollable modal dialog that displays the application's introduction, core mission, and various use cases (lifestyle, health, exercise, social, enterprise) with multi-language support.",
  "frontend/src/components/LanguageSelection.tsx": "A full-screen language selection component with three options (English, Simplified Chinese, Traditional Chinese) displayed as clickable cards with flags.",
  "frontend/src/components/LanguageSwitcher.tsx": "A dropdown menu component for switching between languages (English, Simplified Chinese, Traditional Chinese) with flag icons and native language names.",
  "frontend/src/components/LaunchMission.tsx": "Form component for creating new quests with fields for title, description, reward pool, difficulty, and participant count. Validates inputs and calls createQuest mutation on submission.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper providing header with logo, authentication button, language switcher, and footer. Handles Internet Identity login/logout and query cache clearing.",
  "frontend/src/components/MainApp.tsx": "Main application container with tabbed navigation between BountyBoard, LaunchMission, and PersonalCenter. Handles actor loading states and connection errors with retry functionality.",
  "frontend/src/components/PersonalCenter.tsx": "User profile dashboard displaying credit score, daily check-in, posted bounties, and accepted quests with tabs. Manages dialogs for check-in, progress viewing, quest deletion, exit, and abandonment.",
  "frontend/src/components/QuestCard.tsx": "Card component displaying quest details including title, description, difficulty, reward pool, and participant count. Provides buttons to accept quest or add to pot with deposit confirmation dialogs.",
  "frontend/src/components/SplashScreen.tsx": "Landing page with animated logo, gradient title, feature highlights, and login button. Includes link to open introduction modal explaining how the platform works.",
  "frontend/src/components/VisualComparison.tsx": "A dialog component that displays a visual comparison of quest check-ins, showing Day 1 vs current progress with photos, timestamps, and status text. Includes a timeline view of all check-ins with selectable entries.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, handling authentication state changes and initializing access control with an optional admin token. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing identity state with AuthClient and delegation validation. Includes a provider component and custom hook for accessing authentication state throughout the app.",
  "frontend/src/hooks/useLanguage.ts": "Manages application language state with browser language detection and localStorage persistence. Provides a context and hook for accessing translations via a nested key lookup system.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend API calls including user profile management, quest operations (create, accept, check-in, abandon), and data fetching for active quests, bounties, and disputes. Handles query invalidation and mutation side effects.",
  "frontend/src/i18n/translations.ts": "Defines the TypeScript structure for translation keys covering all UI sections including splash screen, authentication, quests, profiles, and various dialog components. Serves as the schema for multi-language support.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom high-tech dark theme using CSS variables for colors, including neon accent colors (cyan, magenta, blue) and utility classes for neon effects. Defines typography with Orbitron and Inter fonts.",
  "frontend/src/main.tsx": "React application entry point that sets up the root with QueryClient provider and InternetIdentity provider wrapping the main App component.",
  "frontend/src/types.ts": "TypeScript type definitions including Language enum (English, Traditional/Simplified Chinese), ExtendedUserProfile interface, and re-exports of backend types (Difficulty, QuestStatus, UserProfile).",
  "frontend/src/utils/analytics.ts": "Analytics utility module with fire-and-forget tracking, timeout handling, retry logic with exponential backoff, and graceful degradation after repeated failures. Includes trackCreditsChanged and trackEvent functions.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities supporting both query strings and hash-based routing, with sessionStorage persistence functions for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme with neon colors, custom shadows, typography plugins, and animation keyframes for accordions and other UI elements.",
  "project_state.json": "Project state file documenting Grit Bounty platform (ICP-based task bounty system), architectural notes on warrior credit system, and current feature work on adding introduction modal with 'How it works?' link."
}