{
  "backend/main.mo": "Main backend actor implementing quest management system with user profiles, wallet balances, transactions, bounty contributions, daily check-ins, and access control using Motoko on Internet Computer.",
  "feature_evidence.json": "Feature evidence report documenting three fixes: Cancel Quest button triggering CancelQuestDialog, Delete button triggering DeleteQuestDialog, and adding visual feedback/loading states to prevent double-clicks.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including App, Layout, BountyBoard, PersonalCenter, quest dialogs, language management, and styling with descriptions of their functionality and recent changes.",
  "frontend/index.css": "Global CSS with Tailwind directives defining design tokens using OKLCH color space for light and dark themes with sidebar, chart, and UI component color variables.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Grit Bounty application.",
  "frontend/src/App.tsx": "Root application component managing authentication flow (splash/authenticating/authenticated states) with Internet Identity login, 10-second timeout fallback, and conditional rendering of SplashScreen, loading state, or MainApp.",
  "frontend/src/components/AbandonQuestDialog.tsx": "Alert dialog for abandoning accepted quests with confirmation input, displaying deposit forfeiture and deposit rate reset consequences, using useAbandonQuest mutation hook.",
  "frontend/src/components/AddBountyDialog.tsx": "Dialog component for adding bounty contributions to a quest, with balance validation, amount input, and displays current/new reward pool calculations in ICP.",
  "frontend/src/components/AddToPotDialog.tsx": "Dialog for contributing ICP to a quest's reward pool, showing current pool, contribution input, and calculated new pool total.",
  "frontend/src/components/AppealSubmission.tsx": "Card component for submitting appeal arguments with minimum character validation (100 chars), tier badges, and role-based submission permissions.",
  "frontend/src/components/BountyBoard.tsx": "Main quest listing component with difficulty-based tabs (all/easy/medium/hard) that displays active quests in a responsive grid layout.",
  "frontend/src/components/CancelQuestDialog.tsx": "Alert dialog for canceling a quest with full refund details, showing the reward pool amount that will be returned to the publisher.",
  "frontend/src/components/CreditScoreDisplay.tsx": "Card displaying user credit score metrics including deposit rate (50% to 2%), successful quests, progress bar, and total earned/deposited ICP with warnings for high deposit rates.",
  "frontend/src/components/DailyCheckIn.tsx": "Dialog component for submitting daily quest check-ins with status text and optional photo upload, including progress tracking and file size validation.",
  "frontend/src/components/DeleteQuestDialog.tsx": "Alert dialog component that confirms quest deletion with warning messages and handles the delete mutation with loading states.",
  "frontend/src/components/DepositConfirmationDialog.tsx": "Dialog component displaying deposit confirmation details including reward pool, participant count, per-warrior rewards, and deposit amount before processing the transaction.",
  "frontend/src/components/DisputeVoting.tsx": "Component for displaying and managing dispute voting on quests, showing publisher and warrior arguments with weighted voting progress (currently shows placeholder UI when no disputes exist).",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary class component that catches and displays application errors with a reload button and expandable error details.",
  "frontend/src/components/ExitQuestDialog.tsx": "Alert dialog for exiting a quest that displays bounty breakdown, contributor list, and refund details before processing the exit mutation.",
  "frontend/src/components/IntroductionModal.tsx": "A modal dialog component that displays an introduction to the application, including core mission, use cases, and key features, using internationalized content from the useLanguage hook.",
  "frontend/src/components/LanguageSelection.tsx": "A full-screen language selection component that displays three language options (English, Simplified Chinese, Traditional Chinese) with flags and allows users to set their preferred language.",
  "frontend/src/components/LanguageSwitcher.tsx": "A dropdown menu component that allows authenticated users to switch between English, Simplified Chinese, and Traditional Chinese languages, displaying the current language with a globe icon.",
  "frontend/src/components/LaunchMission.tsx": "A form component for creating new quests/missions with fields for title, description, reward pool, difficulty, and participant count, including validation and a confirmation dialog before publishing.",
  "frontend/src/components/Layout.tsx": "The main application layout component that provides a header with logo, authentication button, language switcher, and footer, wrapping all page content.",
  "frontend/src/components/MainApp.tsx": "The main application container with a tabbed interface for Bounty Board, Launch Mission, and Personal Center sections, including loading and error states for actor initialization.",
  "frontend/src/components/PersonalCenter.tsx": "A user dashboard component displaying user profile, credit score, wallet, daily check-in, posted bounties, and accepted quests with tabs for different views and actions like delete, exit, abandon, and cancel quests.",
  "frontend/src/components/PublishQuestConfirmationDialog.tsx": "A confirmation dialog for publishing quests that displays quest details (title, description, reward pool, difficulty, participants), checks user balance sufficiency, and handles the publish action with loading and error states.",
  "frontend/src/components/QuestCard.tsx": "Displays a quest card with details like title, description, difficulty, reward pool, and participant count; allows users to accept quests (with deposit confirmation), add bounties, and view contributors with collapsible sections.",
  "frontend/src/components/SplashScreen.tsx": "The landing page component featuring the Grit Bounty logo, tagline, login button, and three feature cards; includes a link to open an introduction modal explaining how the platform works.",
  "frontend/src/components/TransactionHistory.tsx": "Displays a scrollable list of user transactions with icons, badges for transaction type (deposit, withdrawal, task payment/deduction) and status (success, pending, failed), amounts in ICP, and timestamps.",
  "frontend/src/components/VisualComparison.tsx": "A dialog that displays a visual comparison of quest check-ins, showing Day 1 vs current progress with photos, dates, and status text; includes a timeline of all check-ins with selectable entries.",
  "frontend/src/components/WalletSection.tsx": "Displays user wallet information including ICP balance, deposit address with copy functionality, and buttons to open withdrawal and transaction history dialogs; handles loading states for balance and address queries.",
  "frontend/src/components/WithdrawalDialog.tsx": "Dialog component for withdrawing ICP tokens with destination address input, amount validation, fee calculation (0.01%), and confirmation flow. Handles withdrawal mutations and displays balance, fees, and net amounts.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and auth client lifecycle. Provides authentication status and identity to child components.",
  "frontend/src/hooks/useLanguage.ts": "Context provider and hook for multi-language support with browser language detection (English, Simplified/Traditional Chinese). Manages language state in localStorage and provides translation function.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend data fetching (user profiles, wallet balance, transactions) and mutations (withdraw ICP, accept quests, submit work, vote). Includes cache invalidation and toast notifications.",
  "frontend/src/i18n/translations.ts": "TypeScript translation structure definition for the entire application, covering splash screen, authentication, navigation, bounty board, quest management, wallet, and all UI text across multiple languages.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom dark theme using OKLCH color space, defining neon cyan/magenta/blue accent colors and utility classes for high-tech cyberpunk aesthetic. Includes Orbitron font for headings.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/types.ts": "TypeScript type definitions including Language enum, ExtendedUserProfile interface, and re-exports of backend types like Difficulty, QuestStatus, and UserProfile.",
  "frontend/src/utils/analytics.ts": "Analytics utility with fire-and-forget pattern, timeout handling, retry logic with exponential backoff, and graceful degradation for tracking credits and events.",
  "frontend/src/utils/formatters.ts": "Formatting utilities for ICP amounts (e8 to human-readable), transaction types/statuses with i18n support, and timestamp conversion from nanoseconds to locale strings.",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities for extracting query params from hash-based and browser routing, with sessionStorage persistence and cleanup functions for sensitive data.",
  "frontend/src/utils/validators.ts": "Validation functions for ICP addresses (account identifiers and principal IDs) and withdrawal amounts with balance, fee, and minimum threshold checks.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended theme for neon effects, sidebar colors, custom animations, and typography/container plugins.",
  "project_state.json": "Project state tracking cancel and delete button issues in PersonalCenter, with three existing features for fixing dialog triggers and adding visual feedback during processing."
}