{
  "backend/main.mo": "Main Motoko actor implementing quest management system with access control, user profiles, quest CRUD operations, crowdfunding, daily check-ins, and blob storage integration for a bounty/quest platform.",
  "feature_evidence.json": "Feature evidence report documenting four completed language restriction features that limit the application to only English, Simplified Chinese, and Traditional Chinese across multiple frontend components.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components describing a quest/bounty platform with authentication, multi-language support (3 languages), quest management, personal center, and high-tech dark theme UI.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color space variables defining a dark theme design system with light mode fallback for the application's UI tokens.",
  "frontend/index.html": "HTML entry point for the Grit Bounty application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component managing authentication flow through three states (splash, authenticating, authenticated) with Internet Identity integration, 10-second timeout fallback, and language provider wrapper.",
  "frontend/src/components/AbandonQuestDialog.tsx": "Confirmation dialog for abandoning quests that requires typing 'CONFIRM', displays forfeit amount and deposit rate reset warning, and handles the abandon mutation with loading states.",
  "frontend/src/components/AddToPotDialog.tsx": "Dialog component for adding ICP contributions to a quest's reward pool, with input validation, current/new pool display, and integration with the useAddToPot mutation hook.",
  "frontend/src/components/AppealSubmission.tsx": "Component for submitting appeal arguments during dispute resolution, enforcing a 100-character minimum and displaying tier badges (first/second/third) with role-based submission permissions.",
  "frontend/src/components/BountyBoard.tsx": "Main quest listing component with tabbed difficulty filters (all/easy/medium/hard) that fetches and displays active quests using QuestCard components.",
  "frontend/src/components/CreditScoreDisplay.tsx": "Displays user credit score metrics including deposit rate (50% to 2%), successful quests, progress bar, total earned/deposited ICP, and warnings for high deposit rates.",
  "frontend/src/components/DailyCheckIn.tsx": "Dialog for submitting daily check-ins with status text and optional photo upload (max 5MB), showing current day progress and completion target with upload progress tracking.",
  "frontend/src/components/DeleteQuestDialog.tsx": "Confirmation dialog for deleting quests with warning messages, displaying quest details and handling the delete mutation with loading states.",
  "frontend/src/components/DepositConfirmationDialog.tsx": "A dialog component that displays quest details (reward pool, participants, deposit amount) and allows users to confirm their deposit with ICP transfer. Handles deposit processing with loading states and error handling.",
  "frontend/src/components/DisputeVoting.tsx": "A component for displaying and voting on quest disputes, showing publisher and warrior arguments with weighted voting progress. Currently shows a placeholder state when no disputes exist.",
  "frontend/src/components/ErrorBoundary.tsx": "A React error boundary component that catches and displays application errors with a reload button and expandable error details.",
  "frontend/src/components/ExitQuestDialog.tsx": "An alert dialog that allows quest publishers to exit a quest, displaying contribution details and handling refunds for both publisher and crowdfunding contributors.",
  "frontend/src/components/LanguageSelection.tsx": "A full-screen language selection component that displays English, Simplified Chinese, and Traditional Chinese options with flags and native names for initial language setup.",
  "frontend/src/components/LanguageSwitcher.tsx": "A dropdown menu component in the header that allows users to switch between English, Simplified Chinese, and Traditional Chinese languages after initial setup.",
  "frontend/src/components/LaunchMission.tsx": "A form component for creating new quests with fields for title, description, reward pool (ICP), difficulty level, and participant count. Validates inputs and calls the createQuest mutation.",
  "frontend/src/components/Layout.tsx": "Main layout component with header, footer, and authentication controls. Handles Internet Identity login/logout and displays the Grit Bounty logo and navigation.",
  "frontend/src/components/MainApp.tsx": "Main application container with tabbed navigation between Bounty Board, Launch Mission, and Personal Center. Handles actor loading states and connection errors.",
  "frontend/src/components/PersonalCenter.tsx": "User profile dashboard displaying posted bounties and accepted quests with status badges. Provides actions for check-in, viewing progress, deleting, exiting, and abandoning quests.",
  "frontend/src/components/QuestCard.tsx": "Card component displaying quest details including title, description, difficulty, reward pool, and participant count. Handles quest acceptance with deposit confirmation and adding to pot functionality.",
  "frontend/src/components/SplashScreen.tsx": "Landing page with hero section, animated logo, and feature highlights. Displays call-to-action button to trigger login flow.",
  "frontend/src/components/VisualComparison.tsx": "Dialog component for viewing quest progress through daily check-in photos. Displays side-by-side comparison of Day 1 vs current day with timestamps and status text.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence in local storage, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useLanguage.ts": "React context provider and hook for multi-language support with browser language detection, localStorage persistence, and nested translation key lookup functionality.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including user profiles, quest management (create, accept, add to pot), bounty tracking, and check-ins with automatic cache invalidation.",
  "frontend/src/i18n/translations.ts": "TypeScript translation structure definition containing nested translation keys for all UI text across multiple languages including splash screen, navigation, bounty board, missions, and user interactions.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom high-tech dark theme using OKLCH color space, neon accent colors (cyan, magenta, blue), and utility classes for shadows and borders with cyberpunk aesthetic.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/types.ts": "TypeScript type definitions including Language enum, ExtendedUserProfile interface, and re-exports of backend types like Difficulty, QuestStatus, and UserProfile.",
  "frontend/src/utils/analytics.ts": "Fire-and-forget analytics utility with timeout protection, exponential backoff retry logic, graceful degradation after failures, and functions for tracking credits and generic events.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes (including neon colors), typography, container queries, animations, and design tokens using OKLCH color space.",
  "project_state.json": "Project state tracking file documenting completed features to remove all language options except English, Simplified Chinese, and Traditional Chinese from various components."
}