{
  "backend/main.mo": "Main Motoko actor defining quest management system with types (Quest, UserProfile, QuestStatus, Difficulty), storage for quests and user profiles, access control integration, and public functions for quest CRUD operations, crowdfunding, check-ins, and user profile management.",
  "feature_evidence.json": "Feature evidence report documenting the language switching mechanism fix, listing affected frontend files (App.tsx, LanguageSelection.tsx, LanguageSwitcher.tsx, useLanguage.ts) and related components with high confidence.",
  "frontend-file-summaries.txt": "Pre-generated summaries of all frontend source files describing component responsibilities, including language context integration, quest management UI, user profiles, and translation support across six languages.",
  "frontend/index.css": "Global Tailwind CSS configuration with dark theme design system using OKLCH color space, defining CSS custom properties for colors, borders, and neon accent styling for high-tech aesthetic.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx, titled 'Grit Bounty'.",
  "frontend/src/App.tsx": "Root application component managing authentication flow (splash, authenticating, authenticated states) with LanguageProvider wrapper, Internet Identity integration, and conditional rendering of SplashScreen, loading states, or MainApp based on auth status.",
  "frontend/src/components/AbandonQuestDialog.tsx": "Confirmation dialog for abandoning quests with typed 'CONFIRM' validation, displaying forfeit amount, deposit rate reset warning, and calling useAbandonQuest mutation with loading states and translations.",
  "frontend/src/components/AddToPotDialog.tsx": "Dialog for adding ICP contributions to quest reward pools, showing current pool, contribution input, calculated new pool total, and calling useAddToPot mutation with ICP to e8s conversion.",
  "frontend/src/components/AppealSubmission.tsx": "Component for submitting appeals in a three-tier system, allowing publishers and warriors to provide reasoning (minimum 100 characters) for challenging quest outcomes.",
  "frontend/src/components/BountyBoard.tsx": "Displays active quests in a tabbed interface filterable by difficulty (all/easy/medium/hard), rendering quest cards in a responsive grid layout.",
  "frontend/src/components/CreditScoreDisplay.tsx": "Shows user credit score metrics including deposit rate (50% to 2%), successful quests, total earned/deposited ICP, and progress toward minimum deposit rate with warnings for high rates.",
  "frontend/src/components/DailyCheckIn.tsx": "Dialog component for warriors to submit daily check-ins with status text and optional photo uploads (max 5MB), tracking progress toward quest completion targets.",
  "frontend/src/components/DeleteQuestDialog.tsx": "Alert dialog for confirming quest deletion with warnings about irreversibility, using mutation hooks to handle the delete operation.",
  "frontend/src/components/DepositConfirmationDialog.tsx": "Confirmation dialog showing quest financial details (reward pool, per-warrior reward, deposit rate) before user commits their deposit to join a quest.",
  "frontend/src/components/DisputeVoting.tsx": "Displays dispute voting interface with placeholder UI for viewing active disputes, publisher/warrior arguments, weighted voting progress, and vote submission buttons. Currently shows empty state when no disputes exist.",
  "frontend/src/components/ExitQuestDialog.tsx": "Alert dialog component that allows quest publishers to exit/cancel their quest, showing contribution details and refund information. Handles the exit quest mutation with loading states.",
  "frontend/src/components/LanguageSelection.tsx": "Full-screen language selection component displaying a grid of 15 supported languages with flags and names. Used for initial language selection before authentication.",
  "frontend/src/components/LanguageSwitcher.tsx": "Dropdown menu component for switching between 15 supported languages, showing flags and language names with the current selection highlighted.",
  "frontend/src/components/LaunchMission.tsx": "Form component for creating new quests with fields for title, description, reward pool (ICP), difficulty level, and participant count. Validates inputs and calls createQuest mutation.",
  "frontend/src/components/Layout.tsx": "Main application layout wrapper with fixed header containing logo, language switcher, and Internet Identity login/logout button. Includes footer with attribution link.",
  "frontend/src/components/MainApp.tsx": "Main application component that manages tab navigation between BountyBoard, LaunchMission, and PersonalCenter views, with loading and error states for actor connection.",
  "frontend/src/components/PersonalCenter.tsx": "Personal center dashboard displaying user profile, credit score, posted bounties, and accepted quests with status badges, progress tracking, and action dialogs for check-ins, deletions, and quest management.",
  "frontend/src/components/QuestCard.tsx": "Quest card component displaying quest details (title, description, difficulty, reward pool, participants) with actions to accept quests or add to pot, including deposit confirmation dialogs.",
  "frontend/src/components/SplashScreen.tsx": "Landing page splash screen with animated logo, gradient title, feature highlights, and login button to enter the application.",
  "frontend/src/components/VisualComparison.tsx": "Dialog component that displays a visual comparison of quest progress through daily check-in photos, showing Day 1 vs current day with timestamps and status text.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages the backend actor instance, creating authenticated or anonymous actors based on Internet Identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useLanguage.ts": "Implements language detection, selection, and translation functionality with a React context provider that supports 15+ languages, localStorage persistence, and browser language auto-detection.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend actor methods including user profiles, quest CRUD operations, quest acceptance, pot contributions, and submission/completion workflows.",
  "frontend/src/i18n/translations.ts": "Contains translation strings for the entire application organized by feature area (splash, auth, profile, bountyBoard, etc.) with English as the primary language.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with a high-tech dark theme using OKLCH color space, neon accent colors (cyan, magenta, blue), and custom utility classes for shadows and borders.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context.",
  "frontend/src/types.ts": "Defines frontend-only TypeScript types including Language enum (15 languages), Difficulty enum, Quest interface, and ExtendedUserProfile with language preference.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes (including neon colors), typography, container queries, animations, and design tokens using OKLCH color space.",
  "project_state.json": "Project metadata tracking a known issue where language switching doesn't update the entire interface, with one feature request to fix this behavior."
}