{
  "backend/main.mo": "Main backend actor defining quest management system with types (Quest, UserProfile, QuestStatus, Difficulty), user profile CRUD, quest lifecycle operations (create, accept, cancel, abandon, complete), crowdfunding, daily check-ins, and access control integration.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: publish confirmation dialog, insufficient balance validation, and quest cancellation with full refund, mapping them to test IDs and component dependencies.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including App flow management, three-tab navigation (Bounty Board, Launch Mission, Personal Center), quest cards, dialogs, language support, React Query hooks, and styling configuration.",
  "frontend/index.css": "Global CSS with Tailwind directives defining design tokens using OKLCH color space for light and dark themes, including sidebar, chart, and destructive color variables with custom radius.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, 'Grit Bounty' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root component managing three-step authentication flow (splash/authenticating/authenticated) with 10-second timeout fallback, Internet Identity integration, actor initialization, and conditional rendering of SplashScreen, loading state, or MainApp.",
  "frontend/src/components/AbandonQuestDialog.tsx": "Confirmation dialog for abandoning accepted quests, displaying forfeit amount and deposit rate reset warning, requiring user to type 'CONFIRM' before executing abandon mutation with loading state.",
  "frontend/src/components/AddToPotDialog.tsx": "Dialog component for adding ICP contributions to a quest's reward pool, with input validation, current/new pool display, and integration with the useAddToPot mutation hook.",
  "frontend/src/components/AppealSubmission.tsx": "Component for submitting appeals during dispute resolution, showing current tier badge, requiring minimum 100 characters, and restricting submission to publishers and warriors.",
  "frontend/src/components/BountyBoard.tsx": "Main quest listing component with difficulty-based tabs (all/easy/medium/hard) that fetches and displays active quests using QuestCard components.",
  "frontend/src/components/CancelQuestDialog.tsx": "Alert dialog for quest cancellation that shows refund details and confirms the action using the useCancelQuest mutation hook.",
  "frontend/src/components/CreditScoreDisplay.tsx": "Card component displaying user's deposit rate (50% to 2%), successful quests count, progress bar, earnings/deposits stats, and warnings for high deposit rates.",
  "frontend/src/components/DailyCheckIn.tsx": "Dialog for submitting daily check-ins with status text and optional photo upload (max 5MB), showing progress toward quest completion target.",
  "frontend/src/components/DeleteQuestDialog.tsx": "Alert dialog component for confirming quest deletion with loading state and error handling. Uses useDeleteQuest mutation hook and displays quest title with warning message.",
  "frontend/src/components/DepositConfirmationDialog.tsx": "Dialog component for confirming ICP deposits to quest reward pools. Displays quest details, reward pool, participant count, per-warrior rewards, and deposit rate with processing state management.",
  "frontend/src/components/DisputeVoting.tsx": "Placeholder component for dispute voting interface showing publisher and warrior arguments with weighted voting progress. Currently displays empty state when no disputes exist.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary class component that catches and displays application errors with a reload button. Shows error details in an expandable section for debugging.",
  "frontend/src/components/ExitQuestDialog.tsx": "Alert dialog for publishers to exit quests before they start, showing contribution amounts and refund information. Uses useExitQuest mutation to handle quest exit with loading state.",
  "frontend/src/components/IntroductionModal.tsx": "Scrollable modal dialog displaying platform introduction with sections for core mission and use cases. Shows various quest examples across lifestyle, health, exercise, social, and enterprise categories.",
  "frontend/src/components/LanguageSelection.tsx": "Language selection screen component with three options (English, Simplified Chinese, Traditional Chinese). Displays flag emojis and native language names for user selection.",
  "frontend/src/components/LanguageSwitcher.tsx": "A dropdown menu component that allows users to switch between English, Simplified Chinese, and Traditional Chinese languages using flag icons and native language names.",
  "frontend/src/components/LaunchMission.tsx": "A form component for creating new quests/bounties with fields for title, description, reward pool, difficulty, and participant count, including validation and a confirmation dialog before publishing.",
  "frontend/src/components/Layout.tsx": "The main layout wrapper component providing a fixed header with logo, authentication button, language switcher, and footer with attribution link.",
  "frontend/src/components/MainApp.tsx": "The main application container with a tabbed interface for Bounty Board, Launch Mission, and Personal Center, including loading and error states for actor connection.",
  "frontend/src/components/PersonalCenter.tsx": "A user dashboard component displaying profile information, credit score, daily check-in, posted bounties, and accepted quests with status badges and action buttons for managing quests.",
  "frontend/src/components/PublishQuestConfirmationDialog.tsx": "A confirmation dialog that displays quest details (title, description, reward, difficulty, participants) and validates user balance before allowing quest publication.",
  "frontend/src/components/QuestCard.tsx": "Displays a quest card with title, description, difficulty badge, reward pool, participant count, and action buttons for accepting quests or adding to the pot. Includes dialogs for deposit confirmation and adding funds, with logic to calculate per-warrior rewards and deposit amounts.",
  "frontend/src/components/SplashScreen.tsx": "Renders the landing page with animated logo, gradient title, feature cards, and a login button. Includes a link to open an introduction modal explaining how the platform works.",
  "frontend/src/components/VisualComparison.tsx": "Modal component that displays a visual comparison of quest check-ins, showing Day 1 vs current progress with photos, timestamps, and status text. Includes a scrollable gallery of all check-ins with selection functionality.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login, logout, and identity state management. Creates an AuthClient with configurable options and handles identity persistence across page reloads.",
  "frontend/src/hooks/useLanguage.ts": "Manages application language state with browser language detection, localStorage persistence, and translation lookup functionality. Provides a context for accessing current language and translation functions throughout the app.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, quests, and balances, including operations like creating quests, accepting quests, adding to reward pools, and managing quest lifecycle with proper cache invalidation.",
  "frontend/src/i18n/translations.ts": "Defines TypeScript type structure for multi-language translations covering all UI sections including splash screen, authentication, bounty board, quest management, profile, and various dialog confirmations.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with a high-tech dark theme using OKLCH color space, custom neon accent colors (cyan, magenta, blue), and utility classes for shadows and styling effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers, then renders the main App component.",
  "frontend/src/types.ts": "Defines TypeScript types and enums for the application, including Language enum and ExtendedUserProfile interface that extends backend types with language preference.",
  "frontend/src/utils/analytics.ts": "Implements fire-and-forget analytics tracking with timeout, retry logic, and graceful degradation to prevent blocking application initialization, including functions for tracking credits and generic events.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence and cleanup capabilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending default theme with custom OKLCH color system, neon accent colors, container settings, custom shadows, font families (Inter, Orbitron), and animation keyframes.",
  "project_state.json": "Project state file for Grit Bounty, a habit-forming task bounty platform on Internet Computer. Tracks existing features (confirmation dialog, balance checks, task cancellation) and pending feature requests for bounty payment collection, fund locking, and refund mechanisms."
}