{
  "backend/main.mo": "Main actor defining UserProfile type with credit/deposit tracking fields, includes authorization and blob storage mixins, and provides functions to save/retrieve user profiles by Principal with migration support.",
  "backend/migration.mo": "Migration module transforming old actor state (with quests, payments, language preferences) to new simplified state containing only user profiles with credit score fields (successfulQuests, depositRate, totalEarned, totalDeposited).",
  "feature_evidence.json": "Feature evidence report documenting implemented features including dispute voting interface, appeal submission, credit score display, and quest deposit requirements with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including authentication flow, multi-language support, quest management, credit scoring, dispute resolution, and high-tech dark theme styling.",
  "frontend/index.css": "Tailwind CSS configuration with design tokens for light/dark themes using OKLCH color space, defining CSS variables for background, foreground, borders, and component colors.",
  "frontend/index.html": "HTML entry point for 'Grit Bounty' application with root div and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root component managing authentication state, user profile loading, and conditional rendering of splash screen or main app based on session state with toast notifications.",
  "frontend/src/components/AppealSubmission.tsx": "Form component for submitting dispute appeals with 100-character minimum validation, tier badge display, character counter, and role-based submission permissions for publishers and warriors.",
  "frontend/src/components/BountyBoard.tsx": "Bounty board interface with difficulty-based tabs (easy to impossible) for filtering quests, currently showing placeholder structure with loading and empty states.",
  "frontend/src/components/CreditScoreDisplay.tsx": "Displays user credit score metrics including deposit rate (50% to 2%), successful quests count, progress bar, total earned/deposited ICP, and a warning for high deposit rates above 40%.",
  "frontend/src/components/DepositConfirmationDialog.tsx": "Modal dialog for confirming quest deposits, showing quest title, reward pool, deposit rate, required deposit amount in ICP, and handling the deposit confirmation with error states.",
  "frontend/src/components/DisputeVoting.tsx": "Component for displaying and voting on quest disputes with publisher/warrior arguments, weighted voting progress, time remaining badges, and placeholder UI for when no disputes exist.",
  "frontend/src/components/LanguageSelection.tsx": "Language selection screen with a grid of six language options (Chinese, English, Spanish, French, Japanese, Korean) that saves the user's choice to their profile.",
  "frontend/src/components/LaunchMission.tsx": "Form for creating new quests with fields for title, description/rules, reward pool in ICP, and difficulty level, with validation and toast notifications for success/error states.",
  "frontend/src/components/Layout.tsx": "Main app layout wrapper with fixed header containing logo and Internet Identity login/logout button, main content area with top padding, and footer with caffeine.ai attribution.",
  "frontend/src/components/MainApp.tsx": "Main application component with a tabbed interface for Bounty Board, Launch Mission, Dispute Resolution, and Personal Center. Persists active tab selection to localStorage.",
  "frontend/src/components/PersonalCenter.tsx": "Personal center component displaying user credit score and tabs for accepted quests and posted bounties. Currently uses placeholder data as backend quest functionality is not yet implemented.",
  "frontend/src/components/QuestCard.tsx": "Card component displaying quest details (title, description, reward, difficulty) with accept button that triggers deposit confirmation dialog. Calculates required deposit based on user's deposit rate.",
  "frontend/src/components/SplashScreen.tsx": "Landing page component with animated title, subtitle, and enter button over a background image. Provides initial entry point to the application.",
  "frontend/src/hooks/useActor.ts": "React Query hook managing the backend actor instance with authentication. Creates actor with identity when authenticated, initializes access control, and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle. Provides login, logout, and authentication status tracking.",
  "frontend/src/hooks/useLanguage.ts": "Hook providing internationalization support with translation function and language management. Currently defaults to English as backend language preference storage is not yet implemented.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles and quest operations. User profile queries are functional, while quest-related queries return placeholders as backend implementation is pending.",
  "frontend/src/i18n/translations.ts": "Defines TypeScript translation keys structure and provides complete translations for 6 languages (English, Chinese, Spanish, French, Japanese, Korean) covering splash screen, tabs, bounty board, mission launch, personal center, difficulty levels, credit score, deposit confirmation, dispute resolution, and appeal submission interfaces.",
  "frontend/src/index.css": "Tailwind CSS configuration with dark high-tech theme using OKLCH color space, defining CSS custom properties for neon accent colors (cyan, magenta, blue), and utility classes for shadows, borders, and text effects with the Orbitron display font.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for ICP authentication, rendering the main App component.",
  "frontend/src/types.ts": "Defines frontend TypeScript types including Language enum (6 languages), Difficulty enum (5 levels), Quest interface with status/deposit fields, and ExtendedUserProfile with language preference and financial tracking properties.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with OKLCH-based color system for dark mode, custom neon colors (cyan, magenta, blue), Orbitron display font, custom shadows, and animation keyframes for accordion components.",
  "project_state.json": "Project state document describing Grit Bounty as an ICP-based SocialFi platform with 3-tab navigation, dynamic deposit system (50% to 2%), three-tier dispute resolution with weighted voting, 6% platform fee, and multi-language support across 6 languages."
}