{
  "backend/main.mo": "Main actor defining quest/transaction types, user profiles, and public functions for profile management, transaction viewing, quest operations (create, accept, abandon, check-in, verify), crowdfunding, and blob storage integration with access control.",
  "backend/migration.mo": "Migration module adding transaction tracking (nextTransactionId and transactions map) to the existing actor state while preserving userProfiles, quests, nextQuestId, and systemBountyBalance.",
  "feature_evidence.json": "Feature evidence report documenting four wallet-related features: displaying ICP address, showing balance, implementing withdrawals with 0.01% fee, and displaying transaction history with types and statuses.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including App flow management, layout, language selection, bounty board, quest cards, personal center with wallet integration, hooks for queries and language, translations, and styling configurations.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color space design tokens for light and dark themes, defining CSS variables for background, foreground, card, primary, secondary, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, 'Grit Bounty' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root component managing authentication flow (splash/authenticating/authenticated) with Internet Identity integration, 10-second timeout fallback, query client setup, and conditional rendering of SplashScreen, loading state, or MainApp.",
  "frontend/src/components/AbandonQuestDialog.tsx": "Alert dialog for abandoning quests requiring 'CONFIRM' text input, displaying forfeited deposit amount, deposit rate reset warning, and calling abandonQuestMutation on confirmation.",
  "frontend/src/components/AddToPotDialog.tsx": "Dialog component for adding ICP contributions to a quest's reward pool, with input validation, current/new pool display, and integration with the useAddToPot mutation hook.",
  "frontend/src/components/AppealSubmission.tsx": "Component for submitting appeals during dispute resolution, showing current tier badge, requiring minimum 100 characters, and restricting submission to publishers and warriors.",
  "frontend/src/components/BountyBoard.tsx": "Main quest listing component with difficulty-based tabs (all/easy/medium/hard) that fetches and displays active quests using QuestCard components.",
  "frontend/src/components/CancelQuestDialog.tsx": "Alert dialog for quest cancellation that displays refund details and confirms the action using the useCancelQuest mutation hook.",
  "frontend/src/components/CreditScoreDisplay.tsx": "Card component displaying user's deposit rate (50% to 2%), successful quest count, progress bar, total earned/deposited stats, and warnings for high deposit rates.",
  "frontend/src/components/DailyCheckIn.tsx": "Dialog for submitting daily check-ins with status text and optional photo upload (max 5MB), showing progress toward completion target and handling file preview.",
  "frontend/src/components/DeleteQuestDialog.tsx": "Alert dialog component for confirming quest deletion with loading state, using useDeleteQuest mutation hook and displaying quest title with warning message.",
  "frontend/src/components/DepositConfirmationDialog.tsx": "Dialog component for confirming ICP deposits to quest reward pools, displaying quest details, reward calculations, participant counts, and handling deposit transactions with error states.",
  "frontend/src/components/DisputeVoting.tsx": "Placeholder component for dispute voting interface showing publisher/warrior arguments, weighted voting progress, and time remaining; currently displays empty state when no disputes exist.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary class component that catches and displays application errors with a reload button and expandable error details.",
  "frontend/src/components/ExitQuestDialog.tsx": "Alert dialog for publishers to exit quests, showing contribution amounts, crowdfunding details, and handling refund logic via useExitQuest mutation.",
  "frontend/src/components/IntroductionModal.tsx": "Scrollable modal dialog displaying multi-section introduction content about the platform's mission and use cases (lifestyle, health, exercise, social, enterprise) with localized text.",
  "frontend/src/components/LanguageSelection.tsx": "Language selection screen component offering English, Simplified Chinese, and Traditional Chinese options with flag icons and native language labels.",
  "frontend/src/components/LanguageSwitcher.tsx": "A dropdown menu component that allows users to switch between English, Simplified Chinese, and Traditional Chinese languages using the useLanguage hook.",
  "frontend/src/components/LaunchMission.tsx": "A form component for creating new quests/bounties with fields for title, description, reward pool, difficulty, and participant count, including validation and a confirmation dialog before publishing.",
  "frontend/src/components/Layout.tsx": "The main layout wrapper component providing header with logo, authentication button (login/logout), language switcher, and footer with branding.",
  "frontend/src/components/MainApp.tsx": "The main application container with tabbed navigation between BountyBoard, LaunchMission, and PersonalCenter views, including loading and error states for actor initialization.",
  "frontend/src/components/PersonalCenter.tsx": "A user dashboard component displaying profile information, credit score, daily check-in, wallet section, and tabs for managing posted bounties and accepted quests with various action dialogs.",
  "frontend/src/components/PublishQuestConfirmationDialog.tsx": "A confirmation dialog that displays quest details (title, description, reward, difficulty, participants) and validates user balance before allowing quest publication.",
  "frontend/src/components/QuestCard.tsx": "Displays a quest card with details like title, description, difficulty, reward pool, and participant count. Provides buttons to accept the quest (with deposit confirmation) or add funds to the pot, with special handling for quest owners.",
  "frontend/src/components/SplashScreen.tsx": "Renders the landing page with the Grit Bounty logo, tagline, login button, and three feature cards. Includes a link to open an introduction modal explaining how the platform works.",
  "frontend/src/components/TransactionHistory.tsx": "Displays a scrollable list of user transactions with type icons, status badges, amounts in ICP, and timestamps. Shows loading state or empty state when appropriate.",
  "frontend/src/components/VisualComparison.tsx": "Modal dialog that displays a visual comparison of quest check-ins, showing Day 1 vs current progress with photos, dates, and status text. Includes a timeline view of all check-ins.",
  "frontend/src/components/WalletSection.tsx": "Card component showing wallet balance in ICP, deposit address with copy functionality, and buttons to withdraw funds or view transaction history. Includes collapsible transaction history section.",
  "frontend/src/components/WithdrawalDialog.tsx": "Dialog for withdrawing ICP with input fields for destination address and amount, validation, fee calculation display, and two-step confirmation flow. Shows loading states and error messages.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous actor instance for backend communication, using React Query to cache the actor and invalidate dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout state, identity persistence in local storage, and delegation validity checking with configurable AuthClient options.",
  "frontend/src/hooks/useLanguage.ts": "React context provider and hook for multi-language support with browser language detection, localStorage persistence, and nested translation key lookup functionality.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching user profiles, wallet data, transaction history, and mutations for ICP withdrawals and quest operations, with automatic cache invalidation and error handling.",
  "frontend/src/i18n/translations.ts": "TypeScript translation structure definition containing nested translation keys for all UI text across multiple languages including splash screen, navigation, bounty board, quests, and user profile sections.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom high-tech dark theme using OKLCH color space, neon accent colors (cyan, magenta, blue), and utility classes for shadows and borders with cyberpunk aesthetic.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/types.ts": "TypeScript type definitions including Language enum, ExtendedUserProfile interface, and re-exports of backend types for Difficulty, QuestStatus, and UserProfile.",
  "frontend/src/utils/analytics.ts": "Fire-and-forget analytics utility with timeout protection, exponential backoff retry logic, graceful degradation after repeated failures, and functions to track credits and generic events without blocking the application.",
  "frontend/src/utils/formatters.ts": "Provides utility functions to format ICP amounts (from e8 units to human-readable), transaction types, transaction statuses, and timestamps for display in the UI.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/src/utils/validators.ts": "Validation functions for ICP addresses (account identifiers and principal IDs) and withdrawal amounts, including balance checks, fee calculations, and minimum withdrawal limits.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, neon effects, typography, container queries, animations, and custom design tokens for the application theme.",
  "project_state.json": "Project state tracking document for a task bounty platform with ICP wallet integration, listing existing features (wallet display, balance, withdrawal, transaction history) and pending feature requests for real ICP Ledger integration."
}