{
  "backend/main.mo": "Main backend actor implementing a quest/bounty system with user profiles, wallet balances, transactions, Stripe payment integration, access control, and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting three language-related features: changing default language to English, updating language detection logic, and ensuring language selection screen defaults to English.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including App, Layout, language selection, quest management, payment flows, and translation hooks with detailed implementation notes.",
  "frontend/index.css": "Global CSS with Tailwind directives defining design tokens in OKLCH color space for light and dark themes, including sidebar, chart, and UI component color variables.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, 'Grit Bounty' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component managing authentication flow (splash/authenticating/authenticated states), TanStack Router setup with payment success/cancel routes, and LanguageProvider wrapper.",
  "frontend/src/components/AbandonQuestDialog.tsx": "Alert dialog for abandoning quests with confirmation input, displaying deposit forfeiture and deposit rate reset consequences, with loading and error states.",
  "frontend/src/components/AddBountyDialog.tsx": "Dialog component for adding bounty contributions to quests, with balance validation, USD amount input, and displays current/new reward pool totals.",
  "frontend/src/components/AddToPotDialog.tsx": "Dialog for contributing ICP tokens to a quest's reward pool, showing current pool, contribution input, and calculated new pool total.",
  "frontend/src/components/AppealSubmission.tsx": "Card component for submitting appeals with reasoning text (minimum 100 characters), displays current appeal tier badge, and restricts submission to publishers/warriors.",
  "frontend/src/components/BountyBoard.tsx": "Main quest listing component with difficulty filter tabs (all/easy/medium/hard) that displays active quests in a responsive grid layout.",
  "frontend/src/components/CancelQuestDialog.tsx": "Alert dialog for canceling quests with confirmation, displays full refund amount in ICP, and handles the cancellation mutation.",
  "frontend/src/components/CreditScoreDisplay.tsx": "Card displaying user's deposit rate (50% to 2%), progress bar, successful quests count, total earned/deposited stats, and warnings for high deposit rates.",
  "frontend/src/components/DailyCheckIn.tsx": "Dialog component for submitting daily quest check-ins with status text and optional photo upload. Displays progress tracking, handles file validation, and shows upload progress with toast notifications.",
  "frontend/src/components/DeleteQuestDialog.tsx": "Alert dialog component for confirming quest deletion with warning messages. Displays quest details and handles the delete mutation with loading states and error handling.",
  "frontend/src/components/DepositConfirmationDialog.tsx": "Confirmation dialog for quest deposits showing reward pool details, participant count, per-warrior rewards, and deposit amount. Handles the deposit confirmation flow with error states and processing indicators.",
  "frontend/src/components/DisputeVoting.tsx": "Component for displaying and voting on quest disputes with publisher and warrior arguments. Shows voting progress, time remaining, and weighted voting results (currently with placeholder data).",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches and displays application errors with a fallback UI. Provides error details and a reload button to recover from crashes.",
  "frontend/src/components/ExitQuestDialog.tsx": "Alert dialog for exiting a quest showing bounty breakdown, contributor list, and refund details. Handles the exit quest mutation with error handling and displays financial information in USD.",
  "frontend/src/components/IntroductionModal.tsx": "A modal dialog component that displays an introduction to the application, including core mission, use cases, and other informational sections using internationalized text and styled with neon-themed UI elements.",
  "frontend/src/components/LanguageSelection.tsx": "A full-screen language selection component that displays three language options (English, Simplified Chinese, Traditional Chinese) as clickable cards with flags and native names.",
  "frontend/src/components/LanguageSwitcher.tsx": "A dropdown menu component for switching between languages (English, Simplified Chinese, Traditional Chinese) with a globe icon trigger and flag-based language options.",
  "frontend/src/components/LaunchMission.tsx": "A form component for creating new quests with fields for title, description, reward pool, difficulty, and participant count, including validation and a confirmation dialog before publishing.",
  "frontend/src/components/Layout.tsx": "The main layout wrapper component providing header with logo, authentication button, language switcher, and footer with attribution link to caffeine.ai.",
  "frontend/src/components/MainApp.tsx": "The main application container with a tabbed interface for Bounty Board, Launch Mission, and Personal Center sections, including loading and error states for actor connection.",
  "frontend/src/components/PaymentCancel.tsx": "A page component displayed when a payment is cancelled, showing a warning message and a button to return to the home page.",
  "frontend/src/components/PaymentSuccess.tsx": "A page component that verifies and displays payment success status by fetching Stripe session details, showing loading, error, or success states with a return home button.",
  "frontend/src/components/PersonalCenter.tsx": "Main personal center component displaying user profile, credit score, wallet, daily check-in, and tabs for posted bounties and accepted quests with actions like delete, exit, abandon, and cancel.",
  "frontend/src/components/PublishQuestConfirmationDialog.tsx": "Confirmation dialog for publishing a quest that displays quest details, reward pool, participant count, checks user balance sufficiency, and handles the publish action.",
  "frontend/src/components/QuestCard.tsx": "Card component displaying quest details including title, description, difficulty, reward pool, participant count, and bounty contributions with actions to accept quest or add bounty.",
  "frontend/src/components/RechargeDialog.tsx": "Dialog for recharging user balance via Stripe checkout, allowing users to enter an amount and redirecting to Stripe payment page.",
  "frontend/src/components/SplashScreen.tsx": "Landing page component with animated logo, tagline, login button, and feature highlights, plus a link to open the introduction modal.",
  "frontend/src/components/TransactionHistory.tsx": "Component displaying a scrollable list of user transactions with icons, types, amounts, timestamps, and status badges.",
  "frontend/src/components/VisualComparison.tsx": "Dialog component that displays a visual comparison of quest check-ins, showing Day 1 vs current day photos with timestamps and status text, plus a timeline of all check-ins.",
  "frontend/src/components/WalletSection.tsx": "Card component displaying user wallet balance in USD with buttons to recharge funds and view transaction history in a collapsible section.",
  "frontend/src/components/WithdrawalDialog.tsx": "Dialog for withdrawing ICP funds to an external address; currently disabled with a warning that backend ICP Ledger integration is not yet available.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence in local storage, and AuthClient lifecycle.",
  "frontend/src/hooks/useLanguage.ts": "Context provider and hook for managing application language state with localStorage persistence and translation key lookup from the translations object.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data including user profiles, wallet balances, transactions, quests, and check-ins with automatic cache invalidation.",
  "frontend/src/i18n/translations.ts": "Defines TypeScript types for the complete translation structure covering all UI sections (splash, auth, bounty board, quests, wallet, disputes, etc.) with support for multiple languages.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom dark theme using OKLCH color space, defining CSS variables for neon accent colors (cyan, magenta, blue) and high-tech UI styling with custom font families (Orbitron, Inter).",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for ICP authentication.",
  "frontend/src/types.ts": "Defines core TypeScript types including Language enum, ExtendedUserProfile interface, and re-exports backend types (Difficulty, QuestStatus, UserProfile).",
  "frontend/src/utils/analytics.ts": "Implements fire-and-forget analytics tracking with timeout, retry logic, exponential backoff, and graceful degradation to prevent blocking app initialization.",
  "frontend/src/utils/formatters.ts": "Provides formatting utilities for USD amounts (cents to dollars), transaction types/statuses, timestamps, and deprecated ICP balance formatters.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/src/utils/validators.ts": "Validation functions for ICP addresses (account identifiers and principal IDs) and withdrawal amounts with balance and fee checks.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom OKLCH colors, neon shadows, container settings, font families, and animation keyframes for accordion components.",
  "project_state.json": "Project state file tracking a web application with English as default language, USD wallet system, and Stripe payment integration. Contains three completed features related to English language prioritization and one pending feature request for UI language changes."
}