{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Implement immediate bounty collection on task publication",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add confirmation dialog displaying all task details before final submission when publisher clicks publish button",
      "acceptanceCriteria": [
        "Confirmation dialog appears after clicking publish button",
        "Dialog displays quest title, description, reward pool amount, difficulty, and participant count",
        "Dialog has a confirm button to proceed with publication",
        "Dialog has a cancel button to return to the form"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PublishQuestConfirmationDialog.tsx",
          "operation": "create",
          "description": "Create a new dialog component that displays all quest details (title, description, reward pool, difficulty, participant count) with confirm and cancel buttons. Use shadcn/ui Dialog component for consistency with existing dialogs like DepositConfirmationDialog. Include loading state during quest creation and error handling."
        },
        {
          "path": "frontend/src/components/LaunchMission.tsx",
          "operation": "modify",
          "description": "Modify the form submission flow to open the PublishQuestConfirmationDialog instead of directly calling createQuest mutation. Pass form values (title, description, rewardPool, difficulty, participantCount) to the dialog. The dialog will handle the actual quest creation upon confirmation. Keep all existing form validation logic unchanged."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Display error message and prevent task publication when publisher account balance is insufficient to cover the bounty amount",
      "acceptanceCriteria": [
        "Backend validates sufficient balance before creating quest",
        "Frontend displays clear error message when balance is insufficient",
        "Error message shows required amount and current balance",
        "User remains on the form to adjust bounty amount or cancel",
        "No quest is created when balance check fails"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PublishQuestConfirmationDialog.tsx",
          "operation": "modify",
          "description": "Add balance checking before quest creation. Fetch current user balance and compare with the reward pool amount. If insufficient, display an error alert showing both the required amount and current balance. Use the existing error handling pattern from useQueries hooks. Prevent quest creation and keep the dialog open when balance is insufficient, allowing the user to cancel and return to the form."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new query hook useGetCallerBalance() that fetches the current user's ICP balance from the backend. Use React Query's useQuery with appropriate cache settings. This hook will be used by PublishQuestConfirmationDialog to validate balance before quest creation."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Allow publishers to cancel a task and receive a full refund when no warrior has accepted the task yet, without charging any cancellation fee",
      "acceptanceCriteria": [
        "Cancel button is available on publisher posted quests when acceptedBy array is empty",
        "Clicking cancel returns the full locked bounty amount to publisher balance",
        "No fees are deducted from the refund",
        "Quest is removed from active quests list after cancellation",
        "Cancel button is hidden or disabled once a warrior has accepted the quest"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CancelQuestDialog.tsx",
          "operation": "create",
          "description": "Create a new confirmation dialog for cancelling quests. Display quest details including the full refund amount (matching the reward pool). Show a clear message that the full bounty will be refunded with no fees deducted. Include confirm and cancel buttons. Add loading state during the cancellation mutation and error handling. Use shadcn/ui AlertDialog for consistency with DeleteQuestDialog."
        },
        {
          "path": "frontend/src/components/PersonalCenter.tsx",
          "operation": "modify",
          "description": "Add a 'Cancel Quest' button to posted bounties in the My Bounties tab. Show this button only when the quest status is 'active' and warriorId is undefined (no warrior has accepted yet). Wire the button to open the CancelQuestDialog. Add state management for the selected quest and dialog visibility. Ensure the button is hidden or disabled once a warrior has accepted the quest."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new mutation hook useCancelQuest() that calls the backend cancelQuest method. On success, invalidate the 'myPostedBounties', 'activeQuests', and 'currentUserProfile' query keys to refresh the UI. Handle error cases gracefully and display appropriate error messages to the user."
        }
      ]
    }
  ]
}