{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Set English as default language for all UI content",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Change the default language selection to English for all application interfaces, replacing any current default that may be set to Chinese",
      "acceptanceCriteria": [
        "Application loads with English as the default language on first visit",
        "Login interface displays in English by default",
        "All UI text including splash screen, authentication dialogs, and navigation appears in English by default",
        "Language switcher still allows users to manually change to Chinese if desired"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useLanguage.ts",
          "operation": "modify",
          "description": "Modify the language detection logic to prioritize English ('en') as the default language. Update the initial language determination to return 'en' before checking browser language or localStorage. Ensure that if a user has previously set a language preference in localStorage, that preference is still respected."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update the language detection logic in useLanguage hook to prioritize English over browser language preferences",
      "acceptanceCriteria": [
        "Language hook initializes with 'en' as the default value",
        "Browser language detection is overridden to default to English",
        "localStorage language preference respects user's explicit choice if previously set"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useLanguage.ts",
          "operation": "modify",
          "description": "Refactor the language initialization logic to check localStorage first (to respect user preferences), then default to 'en' instead of browser language detection. Remove or deprioritize browser language preference logic so that new users without a stored preference always see English."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure the language selection screen (if shown on first visit) defaults to English as the pre-selected option",
      "acceptanceCriteria": [
        "Language selection modal highlights English as the default choice",
        "If LanguageSelection component is rendered, English option appears selected or emphasized"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LanguageSelection.tsx",
          "operation": "modify",
          "description": "Update the LanguageSelection component to visually highlight or pre-select the English option as the default choice. Ensure that when the component mounts, the English card is emphasized (e.g., with a border, check mark, or different styling) to indicate it is the default language."
        }
      ]
    }
  ]
}