{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix language switching to update entire interface",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix the language switching mechanism so that all text across the entire application interface updates immediately when a user selects a new language from the dropdown",
      "acceptanceCriteria": [
        "After selecting a language from the dropdown, all visible text in the UI immediately updates to the selected language",
        "The language change persists across page refreshes",
        "All components (SplashScreen, MainApp, BountyBoard, LaunchMission, PersonalCenter, QuestCard, etc.) display text in the selected language",
        "No manual page refresh is required for the language change to take effect"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useLanguage.ts",
          "operation": "modify",
          "description": "Convert the useLanguage hook to use React Context with a provider that wraps the entire application. The context should store the current language state and provide a setLanguage function that updates both the state and localStorage. This ensures all components using the hook re-render when the language changes. The translation function (t) should reference the current language from context state rather than reading directly from localStorage."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap the entire application with the LanguageProvider from the updated useLanguage hook. This should be placed at the top level, outside the InternetIdentityProvider, to ensure language context is available throughout the component tree. The provider wrapping ensures that when language changes, all child components using useLanguage will re-render with the new translations."
        },
        {
          "path": "frontend/src/components/LanguageSwitcher.tsx",
          "operation": "modify",
          "description": "Update the LanguageSwitcher component to use the setLanguage function from the useLanguage context instead of directly manipulating localStorage. When a language is selected from the dropdown, call setLanguage which will trigger the context state update and cause all consuming components to re-render with the new language."
        },
        {
          "path": "frontend/src/components/LanguageSelection.tsx",
          "operation": "modify",
          "description": "Update the LanguageSelection component to use the setLanguage function from the useLanguage context instead of directly manipulating localStorage. When a language is selected from the initial selection screen, call setLanguage to ensure the context state is updated and the application immediately reflects the chosen language."
        }
      ]
    }
  ]
}