{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove all languages except English, Simplified Chinese, and Traditional Chinese",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove all language options except English (en), Simplified Chinese (zh-CN), and Traditional Chinese (zh-TW) from the LanguageSelection component",
      "acceptanceCriteria": [
        "LanguageSelection component displays exactly 3 language options: English, Simplified Chinese, Traditional Chinese",
        "All other language options (Spanish, French, Japanese, Korean, German, Arabic, Portuguese, Russian, Italian, Dutch, Hindi, Turkish, Polish) are removed from the UI"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LanguageSelection.tsx",
          "operation": "modify",
          "description": "Remove all language options except 'en', 'zh-CN', and 'zh-TW' from the language options array. Update the grid layout to display only 3 language options with appropriate styling. Remove flag icons and language data for Spanish, French, Japanese, Korean, German, Arabic, Portuguese, Russian, Italian, Dutch, Hindi, Turkish, and Polish."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove all language options except English (en), Simplified Chinese (zh-CN), and Traditional Chinese (zh-TW) from the LanguageSwitcher component",
      "acceptanceCriteria": [
        "LanguageSwitcher dropdown menu shows exactly 3 language options",
        "Only English, Simplified Chinese, and Traditional Chinese are selectable"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LanguageSwitcher.tsx",
          "operation": "modify",
          "description": "Remove all language options except 'en', 'zh-CN', and 'zh-TW' from the dropdown menu items. Keep only the flag icons and native names for English, Simplified Chinese, and Traditional Chinese. Remove all other language entries from the switcher."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update the Language type enum in frontend/src/types.ts to include only 'en', 'zh-CN', and 'zh-TW', removing all other language codes",
      "acceptanceCriteria": [
        "Language enum contains exactly 3 values: en, zh-CN, zh-TW",
        "All other language codes are removed from the type definition"
      ],
      "file_operations": [
        {
          "path": "frontend/src/types.ts",
          "operation": "modify",
          "description": "Update the Language enum to contain only three values: 'en', 'zh-CN', and 'zh-TW'. Remove all other language codes including 'es', 'fr', 'ja', 'ko', 'de', 'ar', 'pt', 'ru', 'it', 'nl', 'hi', 'tr', and 'pl' from the type definition."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Remove translation objects for all languages except English (en), Simplified Chinese (zh-CN), and Traditional Chinese (zh-TW) from the translations file",
      "acceptanceCriteria": [
        "Translation data structure contains only 3 language objects: en, zh-CN, zh-TW",
        "All translation objects for removed languages are deleted"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useLanguage.ts",
          "operation": "modify",
          "description": "Remove all translation objects except 'en', 'zh-CN', and 'zh-TW' from the translations data structure embedded in the useLanguage hook. Delete translation entries for Spanish, French, Japanese, Korean, German, Arabic, Portuguese, Russian, Italian, Dutch, Hindi, Turkish, and Polish while preserving all translation keys and values for the three retained languages."
        }
      ]
    }
  ]
}